# DataFrames

In [1]:
import numpy as np
import pandas as pd

In [14]:
filas = ['ventas1','ventas2','ventas3']
columnas = ['zonaA','zonaB','zonaC']
datos = [ [123,421,256], [234,541,257], [120,451,258] ]

In [15]:
dataframe = pd.DataFrame(datos,filas,columnas)

In [16]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [17]:
dataframe.loc[ ['ventas1','ventas2'] ]

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [18]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [19]:
dataframe[ ['zonaA','zonaC'] ]

         zonaA  zonaC
ventas1    123    256
ventas2    234    257
ventas3    120    258

In [20]:
dataframe.loc['ventas1']['zonaA']

np.int64(123)

In [21]:
dataframe['Todaslaszonas'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']

In [22]:
dataframe

         zonaA  zonaB  zonaC  Todaslaszonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    258            829

In [23]:
dataframe

         zonaA  zonaB  zonaC  Todaslaszonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    258            829

In [25]:
dataframe.drop('Todaslaszonas',axis=1)

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [26]:
dataframe

         zonaA  zonaB  zonaC  Todaslaszonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    258            829

In [27]:
dataframe.drop('Todaslaszonas',axis=1, inplace=True)

In [28]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [33]:
dataframe.drop("ventas3", inplace=True)

In [34]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [35]:
dataframe.shape

(2, 3)